{
  "WFFL": {
    "Karma Chameleons": "The Chameleons control the #1 seed (73.7%). They clinch it with a win over Ghost Legion OR a Taco Bills loss to Plundering Herd. Only way they drop to #2 is losing to Ghost Legion while Taco Bills wins.",
    "Taco Bills": "Taco Bills have locked up a bye but are chasing the #1 seed (26.4%). They need to beat Plundering Herd AND have Ghost Legion upset Karma Chameleons. Otherwise, they're the #2 seed.",
    "Royal Flush": "Playoffs clinched. Beat The Hack Attack and they're the #3 seed. Lose to The Hack Attack and they drop to #5.",
    "The Hack Attack": "Playoffs clinched. Beat Royal Flush → #3 seed. Lose to Royal Flush → #4 seed if Junkyard Dogs loses to Ellis Islanders, #5 seed if Junkyard Dogs wins.",
    "Junkyard Dogs": "Playoffs clinched. Beat Ellis Islanders → #4 seed locked. Lose to Ellis Islanders → #4 seed if The Hack Attack beats Royal Flush, #5 seed if The Hack Attack loses.",
    "MindHunter": "Controls their destiny at 74% playoff odds. Beat Olympus Mons and they clinch #6. Lose to Olympus Mons and they need BOTH Goldenberg's to lose to THE Washington FT AND Ghost Legion to lose to Karma Chameleons.",
    "Goldenberg's Peanut Chews": "Alive at 14.4%. Must beat THE Washington FT AND have MindHunter lose to Olympus Mons. If both happen, they win a tiebreaker for #6.",
    "Ghost Legion": "Longshot at 11.6%. Need to upset Karma Chameleons on the road AND have MindHunter lose to Olympus Mons AND have Goldenberg's lose to THE Washington FT. All three must happen.",
    "Ellis Islanders": "Eliminated.",
    "Olympus Mons": "Eliminated.",
    "THE Washington (university) FT": "Eliminated.",
    "Plundering Herd": "Eliminated."
  },
  "DFFL": {
    "Boston Stranglers": "Locked into #1 seed and first-round bye regardless of their result against Rockville Reavers.",
    "Vanilla Thunder": "Clinched playoffs. Beat St. Paul Soaks → #2 seed with bye. Lose to St. Paul Soaks → #4 seed, no bye.",
    "Hopewell Hitters": "Playoffs secured. They get #2 seed with bye if Vanilla Thunder loses to St. Paul Soaks. Otherwise they're #4 seed, no bye.",
    "Air Nomad": "Locked into #3 seed in every scenario. Hosting a Wild Card team in Round 1.",
    "Sac-Busters": "Locked into #5 seed regardless of their result against Air Nomad. On the road in Round 1.",
    "St. Paul Soaks": "Strong position at 83.2%. Beat Vanilla Thunder → clinch #6. Lose to Vanilla Thunder → need Al's Offenders to lose to Novato Dawgs AND Kona Heads to lose to The Next Generation.",
    "Al's Offenders": "Slim hopes at 9.2%. Must beat Novato Dawgs AND have St. Paul Soaks lose to Vanilla Thunder. If both happen, wins tiebreaker for #6.",
    "Kona Heads": "Barely alive at 7.6%. Must beat The Next Generation AND have St. Paul Soaks lose to Vanilla Thunder AND have Al's Offenders lose to Novato Dawgs.",
    "Novato Dawgs": "Eliminated.",
    "The Next Generation": "Eliminated.",
    "Pat's Lads": "Eliminated.",
    "Rockville Reavers": "Eliminated."
  },
  "FFPL": {
    "Boomie's Boys": "Locked #1 seed and bye. Result against Mobius Strippers doesn't matter.",
    "Los Pollos Hermanos": "Locked #2 seed and bye. Result against The ReBiggulators doesn't matter.",
    "The ReBiggulators": "Playoffs clinched. They get #4 seed if Boomie's Boys beats Mobius Strippers. They get #5 seed if Mobius Strippers beats Boomie's Boys.",
    "Mobius Strippers": "Playoffs clinched. Beat Boomie's Boys → #4 seed. Lose to Boomie's Boys → #5 seed.",
    "The Original Series": "Clinched playoffs. Beat Free The Nip → #3 seed with home field Round 1. Lose to Free The Nip → #6 seed on the road.",
    "Free The Nip": "Playoffs secured. Beat The Original Series → #3 seed with home field Round 1. Lose to The Original Series → #6 seed on the road.",
    "Gashouse Gorillas": "Safe. Out of playoffs but also safe from relegation regardless of result against Ytterby Yetis.",
    "Hampden Has-Beens": "Danger zone at 54% relegation odds. Beat One Direction Two → safe from relegation. Lose to One Direction Two → relegation playoffs, seeding determined by Lester Pearls vs East Shore Boys result.",
    "Lester Pearls": "In trouble at 59.1% relegation. Beat East Shore Boys → safe from relegation if Hampden beats One Direction Two, relegation playoffs R1/R2 seed if Hampden loses. Lose to East Shore Boys → relegation playoffs.",
    "Ytterby Yetis": "Deep trouble at 86.9% relegation. Beat Gashouse Gorillas → still likely relegated unless both Hampden and Lester Pearls lose. Lose to Gashouse Gorillas → locked into relegation playoffs.",
    "One Direction Two": "Locked into relegation playoffs (100%). Seeding within relegation bracket depends on other results.",
    "East Shore Boys": "Locked into relegation playoffs (100%). Seeding within relegation bracket depends on Hampden vs One Direction Two result."
  }
}
