{
  "WFFL": {
    "Karma Chameleons": "The Chameleons control the #1 seed (73.7%). They clinch it with a win over Ghost Legion OR a Taco Bills loss to Plundering Herd. Only way they drop to #2 is losing to Ghost Legion while Taco Bills wins.",
    "Taco Bills": "Taco Bills have locked up a bye but are chasing the #1 seed (26.4%). They need to beat Plundering Herd AND have Ghost Legion upset Karma Chameleons. Otherwise, they're the #2 seed.",
    "Royal Flush": "Playoffs clinched. Hosting The Hack Attack in a game that determines their seeding - win and they're likely #3 with home field in Round 1, lose and they drop to #5.",
    "The Hack Attack": "Locked into playoffs with seeding on the line. Beat Royal Flush and they're in strong position for #3. A loss drops them to #4 or #5 depending on Junkyard Dogs' result.",
    "Junkyard Dogs": "Playoff spot secured. Heavily favored for #4 seed (72.9%) heading into their game at Ellis Islanders. Could slip to #5 if results elsewhere go against them.",
    "MindHunter": "Controls their destiny at 74% playoff odds. Beat Olympus Mons at home and they clinch #6. A loss means they need BOTH Goldenberg's and Ghost Legion to lose their games.",
    "Goldenberg's Peanut Chews": "Alive at 14.4%. Must beat THE Washington FT AND have MindHunter lose to Olympus Mons. If both happen, they're in a tiebreaker for #6.",
    "Ghost Legion": "Longshot at 11.6% - they face the toughest path. Need to upset Karma Chameleons on the road AND have MindHunter lose AND have Goldenberg's lose. All three must happen.",
    "Ellis Islanders": "Eliminated.",
    "Olympus Mons": "Eliminated.",
    "THE Washington (university) FT": "Eliminated.",
    "Plundering Herd": "Eliminated."
  },
  "DFFL": {
    "Boston Stranglers": "Dominant. Locked into #1 seed and first-round bye regardless of their result against Rockville Reavers.",
    "Vanilla Thunder": "Clinched playoffs, fighting for #2 bye. They're at St. Paul Soaks in a massive swing game - a win locks up #2 (56.4% overall), a loss drops them to #4 and lets Hopewell grab the bye.",
    "Hopewell Hitters": "Playoffs secured, bye week in play. They're at Pat's Lads but need Vanilla Thunder to lose at St. Paul Soaks to grab #2 (43.6%). Otherwise they're locked into #4.",
    "Air Nomad": "Locked into #3 seed in every simulation. They know their playoff position - hosting a Wild Card team in Round 1.",
    "Sac-Busters": "Locked into #5 seed regardless of their result against Air Nomad. They'll be on the road in Round 1.",
    "St. Paul Soaks": "Strong position at 83.2%. Beat Vanilla Thunder at home and they clinch #6. A loss means they need Al's Offenders AND Kona Heads to both lose.",
    "Al's Offenders": "Slim hopes at 9.2%. Must beat Novato Dawgs AND have St. Paul Soaks lose to Vanilla Thunder. Both conditions required.",
    "Kona Heads": "Barely alive at 7.6%. Need to beat The Next Generation AND have St. Paul Soaks lose. Even then, may need a tiebreaker over Al's Offenders.",
    "Novato Dawgs": "Eliminated.",
    "The Next Generation": "Eliminated.",
    "Pat's Lads": "Eliminated.",
    "Rockville Reavers": "Eliminated."
  },
  "FFPL": {
    "Boomie's Boys": "Locked #1 seed. Hosting Mobius Strippers but the result doesn't matter - they've clinched the top spot and bye week.",
    "Los Pollos Hermanos": "Locked #2 seed and bye. Hosting The ReBiggulators but their seeding is set regardless of outcome.",
    "The ReBiggulators": "Playoffs clinched, battling for seeding. At Los Pollos Hermanos - their result combined with Boomie's/Mobius determines if they're #4 (56.4%) or #5 (43.6%).",
    "Mobius Strippers": "Locked into playoffs. Hosting Boomie's Boys with #4/#5 seeding at stake - most likely #5 (56.4%) but could grab #4 depending on other results.",
    "The Original Series": "Clinched with huge seeding swing on the line. They're at Free The Nip in a winner-take-all for #3 vs #6 - win and they host Round 1, lose and they're the 6-seed on the road.",
    "Free The Nip": "Playoffs secured. Hosting The Original Series with everything to play for - winner gets #3 and home field, loser drops to #6. Currently slight favorite for #6 (52.1%).",
    "Gashouse Gorillas": "Safe. Eliminated from playoffs but also safe from relegation. Their game at Ytterby Yetis is meaningless for their standing.",
    "Hampden Has-Beens": "Danger zone at 54% relegation odds. At One Direction Two - a win dramatically improves their safety, a loss likely sends them to the relegation playoffs.",
    "Lester Pearls": "In trouble at 59.1% relegation. At East Shore Boys in a game between two relegation-threatened teams. Win and they improve their position, lose and they're very likely in the relegation bracket.",
    "Ytterby Yetis": "Deep trouble at 86.9% relegation. Hosting Gashouse Gorillas - need to win to have any hope of avoiding relegation playoffs. Even then, need other results to break their way.",
    "One Direction Two": "Locked into relegation playoffs (100%). Hosting Hampden Has-Beens but their fate is sealed - only question is seeding within the relegation bracket.",
    "East Shore Boys": "Locked into relegation playoffs (100%). Hosting Lester Pearls - result affects relegation seeding but they're definitely in the bottom-four bracket."
  }
}
